In [28]:
import pandas as pd
s = pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [29]:
data = {'Name': ['Alice', 'Bob',], 
        'Age':[25,30]}
df = pd.DataFrame(data)   #creating dataframe from dictionary (table form)
print(df)

    Name  Age
0  Alice   25
1    Bob   30

In [ ]:
data = {'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
        'Age':[25, 30 , 35, None, 28, 40],
        'Score':[85,90,78,92,88,75],}
df = pd.DataFrame(data)

print(df.head())  #prints first 5 rows
print(df.head(3)) #prints first 3 rows

print(df.tail())  #prints last 5 rows
print(df.tail(2)) #prints last 2 rows


print(df.isnull())  #checking for null values
df.dropna()  #removing rows with null values

      Name   Age  Score
0    Alice  25.0     85
1      Bob  30.0     90
2  Charlie  35.0     78
3    David   NaN     92
4      Eve  28.0     88
      Name   Age  Score
0    Alice  25.0     85
1      Bob  30.0     90
2  Charlie  35.0     78
      Name   Age  Score
1      Bob  30.0     90
2  Charlie  35.0     78
3    David   NaN     92
4      Eve  28.0     88
5    Frank  40.0     75
    Name   Age  Score
4    Eve  28.0     88
5  Frank  40.0     75
    Name    Age  Score
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False  False
5  False  False  False

      Name   Age  Score
0    Alice  25.0     85
1      Bob  30.0     90
2  Charlie  35.0     78
4      Eve  28.0     88
5    Frank  40.0     75

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     5 non-null      float64
 2   Score   6 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes

In [32]:
df.describe()

            Age      Score
count   5.00000   6.000000
mean   31.60000  84.666667
std     5.94138   6.801961
min    25.00000  75.000000
25%    28.00000  79.750000
50%    30.00000  86.500000
75%    35.00000  89.500000
max    40.00000  92.000000

In [33]:
print(df.columns)

Index(['Name', 'Age', 'Score'], dtype='object')

In [34]:
print(df.shape)

(6, 3)

In [35]:
data = {'Name':['Alice', 'Bob', 'Charlie'],
        'Age':[25, 30 , 35],
        'City':['Delhi', 'Mumbai', 'Banglore'],}

df = pd.DataFrame(data, index=['1','2','3'])
df.loc['1']
df.loc['2', 'Name']
df.loc[:,['Name','City']]

      Name      City
1    Alice     Delhi
2      Bob    Mumbai
3  Charlie  Banglore

In [36]:
df.iloc[0]

Name    Alice
Age        25
City    Delhi
Name: 1, dtype: object

In [37]:
df.iloc[1, 0] #accessing value at 1st row and 0th column

'Bob'

In [38]:
df.iloc[:, 0:2] #accessing all rows and 0th and 1st column

      Name  Age
1    Alice   25
2      Bob   30
3  Charlie   35

In [ ]:
data = {'Name':['Alice','Bob', 'Charlie'],
        'Age':[25, 30 , 35],
        'City':['Delhi', None, 'Banglore'],} 

df.fillna('Unknown')

      Name      Age  Score
0    Alice     25.0     85
1      Bob     30.0     90
2  Charlie     35.0     78
3    David  Unknown     92
4      Eve     28.0     88
5    Frank     40.0     75